{"nodes":[{"name":"Millions of new materials...deep learning","type":"Research","description":"Nov 2023","url":"https://deepmind.google/discover/blog/millions-of-new-materials-discovered-with-deep-learning/#:~:text=GNoME%3A%20Harnessing%20graph%20networks%20for,approach%20based%20on%20chemical%20formulas."},{"name":"Google DeepMind","type":"Authors","description":"","url":""},{"name":"Scrap SF","type":"Business","description":"","url":"https://www.scrap-sf.org/"},{"name":"San Francisco","type":"Locations","description":"","url":""},{"name":"material reuse","type":"Flairs","description":"","url":""},{"name":"ExOne","type":"Business","description":"","url":"https://www.exone.com/en-US/ExOne-Metal-Sand-3D-Printing-Sustainability"},{"name":"3D printing","type":"Flairs","description":"","url":""},{"name":"Prometheus Materials","type":"Business","description":"","url":"https://www.cpr.org/2022/06/20/bio-cement-prometheus-materials/"},{"name":"Colorado","type":"Locations","description":"","url":""},{"name":"bio-material","type":"Flairs","description":"","url":""},{"name":"Emerging Objects","type":"Business","description":"","url":"https://emergingobjects.com/"},{"name":"Forust","type":"Business","description":"","url":"https://www.forust.com/"},{"name":"Blast Studio","type":"Business","description":"","url":"https://www.blast-studio.com/"},{"name":"London","type":"Locations","description":"","url":""},{"name":"shape-memory-embedded polymer","type":"Research","description":"","url":"https://www.youtube.com/watch?v=SjRuuNM8PzY"},{"name":"Kristina Shea","type":"Authors","description":"","url":""},{"name":"Tian (Tim) Chen","type":"Authors","description":"","url":""},{"name":"4D printing","type":"Flairs","description":"","url":""},{"name":"3D graphene","type":"Research","description":"MIT, 2017","url":"https://news.mit.edu/2017/3-d-graphene-strongest-lightest-materials-0106"},{"name":"material performance","type":"Flairs","description":"","url":""},{"name":"Project Chrono","type":"Research","description":"","url":"https://projectchrono.org/"},{"name":"software","type":"Flairs","description":"","url":""},{"name":"open-source","type":"Flairs","description":"","url":""},{"name":"machine learning & engineerign design","type":"Technical","description":"computational fabrication seminar","url":"https://www.youtube.com/watch?v=chMPu5trz2c"},{"name":"Faez Ached","type":"Authors","description":"","url":""},{"name":"Mina Konakovic","type":"Authors","description":"","url":""},{"name":"machine learning","type":"Flairs","description":"","url":""},{"name":"Carbon-negative cement...","type":"Technical","description":"Carbon-negative cement manufacturing from seawater-derived magnesium feedstocks. August 2022.\n\nSignificance:\nThe cement industry is one of the largest sources of man-made carbon dioxide (CO2) emissions and is a hard-to-decarbonize sector that represents a major roadblock to achieving global greenhouse gas emission reduction targets. To address this challenge, the present study demonstrates the key steps in an environmentally friendly process for the manufacture of carbon-negative cement derived from highly abundant magnesium (Mg2+) ions in seawater. If the electricity used to power electrochemical reactors used to harvest Mg2+ is derived from carbon-free electricity sources and CO2 consumed by the process is sourced from the atmosphere or ocean, this carbon-negative process has the potential to transform the world’s most carbon-intensive industries into one of its biggest carbon sinks.\n\nAbstract:\nThis study describes and demonstrates key steps in a carbon-negative process for manufacturing cement from widely abundant seawater-derived magnesium (Mg) feedstocks. In contrast to conventional Portland cement, which starts with carbon-containing limestone as the source material, the proposed process uses membrane-free electrolyzers to facilitate the conversion of carbon-free magnesium ions (Mg2+) in seawater into magnesium hydroxide [Mg(OH)2] precursors for the production of Mg-based cement. After a low-temperature carbonation curing step converts Mg(OH)2 into magnesium carbonates through reaction with carbon dioxide (CO2), the resulting Mg-based binders can exhibit compressive strength comparable to that achieved by Portland cement after curing for only 2 days. Although the proposed “cement-from-seawater” process requires similar energy use per ton of cement as existing processes and is not currently suitable for use in conventional reinforced concrete, its potential to achieve a carbon-negative footprint makes it highly attractive to help decarbonize one of the most carbon-intensive industries.\n","url":"https://www.pnas.org/doi/epdf/10.1073/pnas.2114680119"},{"name":"Palash Badjatya et al","type":"Authors","description":"","url":""},{"name":"embodied carbon","type":"Flairs","description":"","url":""},{"name":"concrete/cement","type":"Flairs","description":"","url":""},{"name":"Distill","type":"Research","description":"AI publishers, articles, etc. The site stopped updating in 2021.","url":"https://distill.pub/"},{"name":"Exoskeleton in Architecture","type":"Research","description":"","url":"https://typesofartstyles.com/exoskeleton/"},{"name":"structure","type":"Flairs","description":"","url":""},{"name":"Tree fork joints MIT","type":"Research","description":"2022","url":"https://www.dezeen.com/2022/05/05/tree-forks-mit-digital-structures-architecture/?li_source=LI&li_medium=rhs_block_1#"},{"name":"Digital Structures @MIT","type":"Authors","description":"","url":"http://digitalstructures.mit.edu/"},{"name":"A fast and elitist...algorithm","type":"Technical","description":"A fast and elitist multiobjective genetic algorithm: NSGA-II. 2002\n\nTLDR\nThis paper suggests a non-dominated sorting-based MOEA, called NSGA-II (Non-dominated Sorting Genetic Algorithm II), which alleviates all of the above three difficulties, and modify the definition of dominance in order to solve constrained multi-objective problems efficiently.\n\nAbstract\nMulti-objective evolutionary algorithms (MOEAs) that use non-dominated sorting and sharing have been criticized mainly for: (1) their O(MN/sup 3/) computational complexity (where M is the number of objectives and N is the population size); (2) their non-elitism approach; and (3) the need to specify a sharing parameter. In this paper, we suggest a non-dominated sorting-based MOEA, called NSGA-II (Non-dominated Sorting Genetic Algorithm II), which alleviates all of the above three difficulties. Specifically, a fast non-dominated sorting approach with O(MN/sup 2/) computational complexity is presented. Also, a selection operator is presented that creates a mating pool by combining the parent and offspring populations and selecting the best N solutions (with respect to fitness and spread). Simulation results on difficult test problems show that NSGA-II is able, for most problems, to find a much better spread of solutions and better convergence near the true Pareto-optimal front compared to the Pareto-archived evolution strategy and the strength-Pareto evolutionary algorithm - two other elitist MOEAs that pay special attention to creating a diverse Pareto-optimal front. Moreover, we modify the definition of dominance in order to solve constrained multi-objective problems efficiently. Simulation results of the constrained NSGA-II on a number of test problems, including a five-objective, seven-constraint nonlinear problem, are compared with another constrained multi-objective optimizer, and the much better performance of NSGA-II is observed.\n","url":"https://www.semanticscholar.org/paper/A-fast-and-elitist-multiobjective-genetic-NSGA-II-Deb-Agrawal/6eddc19efa13f7e70301908d98e85a19d6f32a02?p2df"},{"name":"multi-objective","type":"Flairs","description":"","url":""},{"name":"A review on wood powders in 3D printing...","type":"Research","description":"Abstract\n\nThree-dimensional (3D) printing is a technology that, for a multitude of raw materials, can be used in the production of complex structures. Many of the materials that currently dominate 3D printing (e.g. titanium, steel, plastics, and concrete) have issues with high costs and environmental sustainability. Wood powder is a widely available and renewable lignocellulosic material that, when used as a fibre component, can reduce the cost of 3D printed products. Wood powder in combination with synthetic or natural binders has potential for producing a wide variety of products and for prototyping. The use of natural binders along with wood powder can then enable more sustainable 3D printed products. However, 3D printing is an emerging technology in many applications and more research is needed. This review aims to provide insight into wood powder as a component in 3D printing, properties of resulting products, and the potential for future applications.","url":"https://www.sciencedirect.com/science/article/pii/S2238785421007730#!"},{"name":"wood","type":"Flairs","description":"","url":""},{"name":"Case Study: O-14 Folded Exoskeleton","type":"Research","description":"2010","url":"https://global.ctbuh.org/resources/papers/download/27-case-study-o-14-folded-exoskeleton.pdf"},{"name":"Computational LEGO® Technic Design","type":"Technical","description":"2020","url":"https://arxiv.org/pdf/2007.02245.pdf"},{"name":"assembly","type":"Flairs","description":"","url":""},{"name":"...Non-coplanar Exoskeleton Supertall Tower","type":"Research","description":"2015","url":"https://global.ctbuh.org/resources/papers/download/2422-designing-a-non-coplanar-exoskeleton-supertall-tower-that-transforms-the-skyline-of-chengdu.pdf"},{"name":"...Humidity on 3D-printed...Wood-PLA...","type":"Technical","description":"EFFECT OF HUMIDITY ON 3D-PRINTED SPECIMENS FROM WOOD-PLA FILAMENTS. 2018\n\nABSTRACT\n\nFilaments from a mixture of wood powder and polylactic acid (PLA) polymer were made\nand used for 3D printing. Different wood ratios were used: 10 %, 20 %, 30 %, 40 %, and 50 %.\nSpecimens were 3D-printed with fused deposition modelling (FDM) printer and conditioned in\nclimates with different levels of relative moisture (RH): 33 %, 65 %, and 87 %. Moisture content\n(MC), dimensional swelling, and bending properties of printed specimens were measured after\nconditioning. The results showed that specimens made from filaments with higher wood content\nhad higher moisture content, larger dimensional swelling, and lower modulus of elasticity (MOE).\n","url":"http://www.woodresearch.sk/cms/wp-content/uploads/2021/09/Effect-of-humidity-on-3D-printed-specimens.pdf#:~:text=Moisture%20content%20%28MC%29%2C%20dimensional%20swelling%2C%20and%20bending%20properties,dimensional%20swelling%2C%20and%20lower%20modulus%20of%20elasticity%20%28MOE%29."},{"name":"Evolutionary Computation for Topology Optimization...","type":"Technical","description":"Evolutionary Computation for Topology Optimization of Mechanical Structures: An Overview of Representations. 2016\n\nDuring the past decade, continuum topology optimization became an important industrial tool for the conceptual design of mechanical structures. The field of evolutionary computation provides suitable stochastic optimization algorithms for problems involving strong non-linearities or black-box simulations , for which existing gradient-based methods are not feasible. Due to the high design freedom of the phenotypic space, the encoding of the structural design is a critical aspect when applying evolutionary algorithms. Currently, the encoding approaches are scattered throughout different literature fields. This paper gathers them and provides a contemporary overview on the various structural representations used in conjunction with evolutionary computation for topology optimization. The important influence of the representation on the scalability of the approaches motivates the proposed categorization in three groups: Grid, Geometric and Indirect Representations. The existing representations are described and discussed on a conceptual level and chances and challenges are outlined.\n","url":""},{"name":"topology","type":"Flairs","description":"","url":""},{"name":"algorithm","type":"Flairs","description":"","url":""},{"name":"Growing and Evolving 3D Prints","type":"Technical","description":"2021\n\nAbstract—Design – especially of physical objects – can be\nunderstood as creative acts solving practical problems. In this\npaper we describe a biologically-inspired developmental model\nas the basis of a generative form-finding system. Using local\ninteractions between cells in a two-dimensional environment, then\ncapturing the state of the system at every time step, complex\nthree-dimensional (3D) forms can be generated by the system. Unlike previous systems, our method is capable of directly producing\n3D printable objects, eliminating intermediate transformations\nand manual manipulation often necessary to ensure the 3D form\nis printable. We devise fitness measures for optimising 3D printability and aesthetic complexity and use a Covariance Matrix\nAdaptation Evolutionary Strategies algorithm (CMA-ES) to find\n3D forms that are both aesthetically interesting and physically\nprintable using fused deposition modelling printing techniques.\nWe investigate the system’s capabilities by evolving and 3D\nprinting objects at different levels of structural consistency, and\nassess the quality of the fitness measures presented to explore\nthe design space of our generative system. We find that by\nevolving first for aesthetic complexity, then evolving for structural\nconsistency until the form is ‘just printable’, gives the best results.\n\nAbstract—Design – especially of physical objects – can be\nunderstood as creative acts solving practical problems. In this\npaper we describe a biologically-inspired developmental model\nas the basis of a generative form-finding system. Using local\ninteractions between cells in a two-dimensional environment, then\ncapturing the state of the system at every time step, complex\nthree-dimensional (3D) forms can be generated by the system. Unlike previous systems, our method is capable of directly producing\n3D printable objects, eliminating intermediate transformations\nand manual manipulation often necessary to ensure the 3D form\nis printable. We devise fitness measures for optimising 3D printability and aesthetic complexity and use a Covariance Matrix\nAdaptation Evolutionary Strategies algorithm (CMA-ES) to find\n3D forms that are both aesthetically interesting and physically\nprintable using fused deposition modelling printing techniques.\nWe investigate the system’s capabilities by evolving and 3D\nprinting objects at different levels of structural consistency, and\nassess the quality of the fitness measures presented to explore\nthe design space of our generative system. We find that by\nevolving first for aesthetic complexity, then evolving for structural\nconsistency until the form is ‘just printable’, gives the best results.\n","url":"https://arxiv.org/pdf/2107.02976.pdf"},{"name":"Hybrid Evolutionary...Topology Optimization","type":"Technical","description":"Hybrid Evolutionary Approach for Level Set Topology Optimization. 2016\n\nAbstract—Although Topology Optimization is widely used in\nmany industrial applications, it is still in the initial phase of development for highly nonlinear, multimodal and noisy problems,\nwhere the analytical sensitivity information is either not available\nor difficult to obtain. For these problems, including the highly\nrelevant crashworthiness optimization, alternative approaches,\nrelying not solely on the gradient, are necessary. One option are\nEvolutionary Algorithms, which are well-suited for this type of\nproblems, but with the drawback of considerable computational\ncosts. In this paper we propose a hybrid evolutionary optimization method using a geometric Level-Set Method for an implicit\nrepresentation of mechanical structures. Hybrid optimization\napproach integrates gradient information in stochastic search\nto improve convergence behavior and global search properties.\nGradient information can be obtained from structural state\nas well as approximated via equivalent state or any known\nheuristics. In order to evaluate the proposed methods, a minimum\ncompliance problem for a standard cantilever beam benchmark\ncase is considered. These results show that the hybridization is\nvery beneficial in terms of convergence speed and performance\nof the optimized designs.\n","url":"https://www.honda-ri.de/pubs/pdf/3186.pdf"},{"name":"...Geometry...Optimizing Component Structure","type":"Technical","description":"Nature-Based Hybrid Computational Geometry System for Optimizing Component Structure. 2018\n\nAbstract. This paper describes a novel computational geometry system\ndeveloped for application in the design of full-scale industrial components. This\nsystem combines a bottom-up growth strategy based on slime mould behaviour\nin nature with a top-down genetic algorithm strategy for optimization. The\ngrowth strategy uses an agent-based algorithm to create individual instances of\ndesigns based on a small number of input parameters. These parameters can then\nbe controlled by a genetic algorithm to optimize the final design according to\ngoals such as minimizing weight and minimizing structural weakness. Together,\nthese two strategies create a hybrid approach which ensures high performance\nwhile allowing the designer to explore a wider range of novel designs than\nwould be possible using traditional design methods.\n","url":"https://www.research.autodesk.com/app/uploads/2023/03/naturebased-hybrid-computational-geometry.pdf_recI56YMBGnvygbLP.pdf"},{"name":"State of the Art...Assemblies with Rigid Parts","type":"Technical","description":"State of the Art on Computational Design of Assemblies with Rigid Parts. 2021\n\nTLDR\nThis report focuses on computational design of structures with rigid parts, which generally can be formulated as a geometric modeling and optimization problem, and broadly classify existing computational design approaches, mainly from the computer graphics community, according to high‐level design objectives.\n\nAbstract\nAn assembly refers to a collection of parts joined together to achieve a specific form and/or functionality. Designing assemblies is a non‐trivial task as a slight local modification on a part's geometry or its joining method could have a global impact on the structural and/or functional performance of the whole assembly. Assemblies can be classified as structures that transmit force to carry loads and mechanisms that transfer motion and force to perform mechanical work. In this state‐of‐the‐art report, we focus on computational design of structures with rigid parts, which generally can be formulated as a geometric modeling and optimization problem. We broadly classify existing computational design approaches, mainly from the computer graphics community, according to high‐level design objectives, including fabricability, structural stability, reconfigurability, and tileability. Computational analysis of various aspects of assemblies is an integral component in these design approaches. We review different classes of computational analysis and design methods, discuss their strengths and limitations, make connections among them, and propose possible directions for future research.\n","url":"https://www.semanticscholar.org/paper/State-of-the-Art-on-Computational-Design-of-with-Wang-Song/de97a7ae0f0ee312260726fbe0f84fa09f1aa2af"},{"name":"...SIMP and BESO...Additive Manufacture","type":"Technical","description":"Suitability of SIMP and BESO Topology Optimization Algorithms for Additive Manufacture. 2010\n\nAdditive manufacturing (AM) is expanding the range of designable geometries,\nbut to exploit this evolving design space new methods are required to find\noptimum solutions. Finite element based topology optimisation (TO) is a\npowerful method of structural optimization, however the results obtained tend to\nbe dependent on the algorithm used, the algorithm parameters and the finite\nelement mesh. This paper will discuss these issues as it relates to the SIMP and\nBESO algorithms. An example of the application of topological optimization to\nthe design of improved structures is given. \n","url":"http://utw10945.utweb.utexas.edu/Manuscripts/2010/2010-57-Aremu.pdf"},{"name":"...Complex Physics with Graph Networks","type":"Technical","description":"Learning to Simulate Complex Physics with Graph Networks. 2020\n\nHere we present a machine learning framework and model implementation that can learn to simulate a wide variety of challenging physical domains, involving fluids, rigid solids, and deformable materials interacting with one another. Our framework---which we term \"Graph Network-based Simulators\" (GNS)---represents the state of a physical system with particles, expressed as nodes in a graph, and computes dynamics via learned message-passing. Our results show that our model can generalize from single-timestep predictions with thousands of particles during training, to different initial conditions, thousands of timesteps, and at least an order of magnitude more particles at test time. Our model was robust to hyperparameter choices across various evaluation metrics: the main determinants of long-term performance were the number of message-passing steps, and mitigating the accumulation of error by corrupting the training data with noise. Our GNS framework advances the state-of-the-art in learned physical simulation, and holds promise for solving a wide range of complex forward and inverse problems.\n","url":"https://arxiv.org/abs/2002.09405"},{"name":"GNN","type":"Flairs","description":"","url":""},{"name":"Ridwell","type":"Business","description":"recycling program","url":"https://www.ridwell.com/"},{"name":"Atlanta","type":"Locations","description":"","url":""},{"name":"Austin","type":"Locations","description":"","url":""},{"name":"Bay Area","type":"Locations","description":"","url":""},{"name":"Denver","type":"Locations","description":"","url":""},{"name":"Los Angeles","type":"Locations","description":"","url":""},{"name":"Minneapolis-St. Paul","type":"Locations","description":"","url":""},{"name":"Portland","type":"Locations","description":"","url":""},{"name":"Seattle","type":"Locations","description":"","url":""},{"name":"material recycling","type":"Flairs","description":"","url":""},{"name":"FEA formulas","type":"Technical","description":"rod axial stiffness = EA\nstress (σ) = P/A\nstrain (ε) = σ/E = du/dx (u: longitudinal displacement)","url":""},{"name":"FEA","type":"Flairs","description":"","url":""},{"name":"...Multi-domain protein shape retrieval...","type":"Technical","description":"SHREC 2020: Multi-domain protein shape retrieval challenge. 2020.\n\nAbstract\nProteins are natural modular objects usually composed of several domains, each domain bearing a specific function that is mediated through its surface, which is accessible to vicinal molecules. This draws attention to an understudied characteristic of protein structures: surface, that is mostly unexploited by protein structure comparison methods. In the present work, we evaluated the performance of six shape comparison methods, among which three are based on machine learning, to distinguish between 588 multi-domain proteins and to recreate the evolutionary relationships at the proteinand species levels of the SCOPe database.\n\nThe six groups that participated in the challenge submitted a total of 15 sets of results. We observed that the performance of all the methods significantly decreases at the species level, suggesting that shape-only protein comparison is challenging for closely related proteins. Even if the dataset is limited in size (only 588 proteins are considered whereas more than 160,000 protein structures are experimentally solved), we think that this work provides useful insights into the current shape comparison methods performance, and highlights possible limitations to large-scale applications due to the computational cost.","url":"https://www.sciencedirect.com/science/article/abs/pii/S0097849320301151"},{"name":"geometry","type":"Flairs","description":"","url":""},{"name":"Simulated Annealing","type":"Technical","description":"The URL links to a quick intro.","url":"https://www.cs.cmu.edu/afs/cs.cmu.edu/project/learn-43/lib/photoz/.g/web/glossary/anneal.html"},{"name":"Generative Models: What do they know?...","type":"Technical","description":"Generative Models: What do they know? Do they know things? Let's find out! 2023\n\nGenerative models have been shown to be capable of synthesizing highly detailed and realistic images. It is natural to suspect that they implicitly learn to model some image intrinsics such as surface normals, depth, or shadows. In this paper, we present compelling evidence that generative models indeed internally produce high-quality scene intrinsic maps. We introduce Intrinsic LoRA (I LoRA), a universal, plug-and-play approach that transforms any generative model into a scene intrinsic predictor, capable of extracting intrinsic scene maps directly from the original generator network without needing additional decoders or fully fine-tuning the original network. Our method employs a Low-Rank Adaptation (LoRA) of key feature maps, with newly learned parameters that make up less than 0.6% of the total parameters in the generative model. Optimized with a small set of labeled images, our model-agnostic approach adapts to various generative architectures, including Diffusion models, GANs, and Autoregressive models. We show that the scene intrinsic maps produced by our method compare well with, and in some cases surpass those generated by leading supervised techniques.\n","url":"https://arxiv.org/abs/2311.17137"},{"name":"Lora","type":"Flairs","description":"","url":""},{"name":"Introduction to RL and Deep Q Networks","type":"Technical","description":"","url":"https://www.tensorflow.org/agents/tutorials/0_intro_rl#dqn_on_cartpole_in_tf-agents"},{"name":"reinforcement learning","type":"Flairs","description":"","url":""},{"name":"Deep Deterministic Policy Gradient","type":"Technical","description":"","url":"https://spinningup.openai.com/en/latest/algorithms/ddpg.html"},{"name":"OpeningAI","type":"Authors","description":"","url":""},{"name":"Continuous Control with Deep Reinforcement Learning","type":"Technical","description":"2015.\n\nABSTRACT\nWe adapt the ideas underlying the success of Deep Q-Learning to the continuous action domain. We present an actor-critic, model-free algorithm based on the deterministic policy gradient that can operate over continuous action spaces. Using the same learning algorithm, network architecture and hyper-parameters, our algorithm robustly solves more than 20 simulated physics tasks, including classic problems such as cartpole swing-up, dexterous manipulation, legged locomotion and car driving. Our algorithm is able to find policies whose performance is competitive with those found by a planning algorithm with full access to the dynamics of the domain and its derivatives. We further demonstrate that for many of the tasks the algorithm can learn policies “end-to-end”: directly from raw pixel inputs.\n","url":"https://arxiv.org/pdf/1509.02971.pdf"},{"name":"Deep Reinforcement Learning and the Deadly Triad","type":"Technical","description":"2018.\n\nABSTRACT\nWe know from reinforcement learning theory that temporal difference learning can fail in certain cases. Sutton and Barto (2018) identify a deadly triad of function approximation, bootstrapping, and off-policy learning. When these three properties are combined, learning can diverge with the value estimates becoming unbounded. However, several algorithms successfully combine these three properties, which\nindicates that there is at least a partial gap in our understanding. In this work, we investigate the impact of the deadly triad in practice, in the context of a family of popular deep reinforcement learning models— deep Q-networks trained with experience replay—analysing how the components of this system play a role in the emergence of the deadly triad, and in the agent’s performance.","url":"https://arxiv.org/pdf/1812.02648.pdf"},{"name":"CONVERGENT AND EFFICIENT DEEP Q NETWORK ALGORITHM","type":"Technical","description":"2022.\n\nABSTRACT\nDespite the empirical success of the deep Q network (DQN) reinforcement learning algorithm and its variants, DQN is still not well understood and it does not guarantee convergence. In this work, we show that DQN can indeed diverge and cease to operate in realistic settings. Although there exist gradient-based convergent methods, we show that they actually have inherent problems in learning dynamics which cause them to fail even in simple tasks. To overcome these problems, we propose a convergent DQN algorithm (C-DQN) that is guaranteed to converge and can work with large discount factors (∼ 0.9998). It learns robustly in difficult settings and can learn several difficult games in the Atari 2600 benchmark that DQN fails to solve. Our codes have been publicly released and can be used to reproduce our results.","url":"https://arxiv.org/pdf/2106.15419.pdf"},{"name":"...Divergence in Deep Q-Learning","type":"Technical","description":"Towards Characterizing Divergence in Deep Q-Learning. 2019.\n\nAbstract\nDeep Q-Learning (DQL), a family of temporal difference algorithms for control, employs three techniques collectively known as the ‘deadly triad’ in reinforcement learning: bootstrapping, off-policy\nlearning, and function approximation. Prior work has demonstrated that together these can lead to divergence in Q-learning algorithms, but the conditions under which divergence occurs are not well-understood. In this note, we give a simple analysis based on a linear approximation to the Q-value updates, which we believe provides insight into divergence under the deadly triad. The central point in our analysis is to consider when the leading order approximation to the deep-Q update is or is not a contraction in the sup norm. Based on this analysis, we develop an algorithm which permits stable deep Q-learning for continuous control without any of the tricks conventionally used (such as target networks, adaptive gradient optimizers, or using multiple Q functions). We demonstrate that our algorithm performs above or near state-of-the-art on standard MuJoCo benchmarks from the OpenAI Gym.","url":"https://arxiv.org/pdf/1903.08894.pdf"},{"name":"list of probability distributions","type":"Technical","description":"","url":"https://en.wikipedia.org/wiki/List_of_probability_distributions"},{"name":"statistics","type":"Flairs","description":"","url":""},{"name":"Emergent...memory...metamaterials","type":"Technical","description":"Emergent disorder and mechanical memory in periodic metamaterials. 2024.\n\nAbstract\nOrdered mechanical systems typically have one or only a few stable rest configurations, and hence are not considered useful for encoding memory. Multistable and history-dependent responses usually emerge from quenched disorder, for example in amorphous solids or crumpled sheets. In contrast, due to geometric frustration, periodic magnetic systems can create their own disorder and espouse an extensive manifold of quasi-degenerate configurations. Inspired by the topological structure of frustrated artificial spin ices, we introduce an approach to design ordered, periodic mechanical metamaterials that exhibit an extensive set of spatially disordered states. While our design exploits the correspondence between frustration in magnetism and incompatibility in meta-mechanics, our mechanical systems encompass continuous degrees of freedom, and thus generalize their magnetic counterparts. We show how such systems exhibit non-Abelian and history-dependent responses, as their state can depend on the order in which external manipulations were applied. We demonstrate how this richness of the dynamics enables to recognize, from a static measurement of the final state, the sequence of operations that an extended system underwent. Thus, multistability and potential to perform computation emerge from geometric frustration in ordered mechanical lattices that create their own disorder.","url":"https://www.nature.com/articles/s41467-024-47780-w"},{"name":"Attention Is All You Need","type":"Technical","description":"Abstract\n\nThe dominant sequence transduction models are based on complex recurrent or convolutional neural networks that include an encoder and a decoder. The best performing models also connect the encoder and decoder through an attention\nmechanism. We propose a new simple network architecture, the Transformer, based solely on attention mechanisms, dispensing with recurrence and convolutions entirely. Experiments on two machine translation tasks show these models to\nbe superior in quality while being more parallelizable and requiring significantly less time to train. Our model achieves 28.4 BLEU on the WMT 2014 Englishto-German translation task, improving over the existing best results, including ensembles, by over 2 BLEU. On the WMT 2014 English-to-French translation task, our model establishes a new single-model state-of-the-art BLEU score of 41.8 after training for 3.5 days on eight GPUs, a small fraction of the training costs of the\nbest models from the literature. We show that the Transformer generalizes well to other tasks by applying it successfully to English constituency parsing both with large and limited training data.","url":"https://arxiv.org/pdf/1706.03762"}],"links":[{"source":"San Francisco","target":"Scrap SF","group":"___is the location of___"},{"source":"material reuse","target":"Scrap SF","group":"___is the flair of___"},{"source":"3D printing","target":"ExOne","group":"___is the flair of___"},{"source":"Colorado","target":"Prometheus Materials","group":"___is the location of___"},{"source":"bio-material","target":"Prometheus Materials","group":"___is the flair of___"},{"source":"San Francisco","target":"Emerging Objects","group":"___is the location of___"},{"source":"3D printing","target":"Emerging Objects","group":"___is the flair of___"},{"source":"3D printing","target":"Forust","group":"___is the flair of___"},{"source":"bio-material","target":"Forust","group":"___is the flair of___"},{"source":"London","target":"Blast Studio","group":"___is the location of___"},{"source":"3D printing","target":"Blast Studio","group":"___is the flair of___"},{"source":"Kristina Shea","target":"shape-memory-embedded polymer","group":"___is the author of___"},{"source":"Tian (Tim) Chen","target":"shape-memory-embedded polymer","group":"___is the author of___"},{"source":"4D printing","target":"shape-memory-embedded polymer","group":"___is the flair of___"},{"source":"3D printing","target":"3D graphene","group":"___is the flair of___"},{"source":"material performance","target":"3D graphene","group":"___is the flair of___"},{"source":"software","target":"Project Chrono","group":"___is the flair of___"},{"source":"open-source","target":"Project Chrono","group":"___is the flair of___"},{"source":"Faez Ached","target":"machine learning & engineerign design","group":"___is the author of___"},{"source":"Mina Konakovic","target":"machine learning & engineerign design","group":"___is the author of___"},{"source":"machine learning","target":"machine learning & engineerign design","group":"___is the flair of___"},{"source":"structure","target":"Exoskeleton in Architecture","group":"___is the flair of___"},{"source":"Digital Structures @MIT","target":"Tree fork joints MIT","group":"___is the author of___"},{"source":"structure","target":"Tree fork joints MIT","group":"___is the flair of___"},{"source":"wood","target":"A review on wood powders in 3D printing...","group":"___is the flair of___"},{"source":"3D printing","target":"A review on wood powders in 3D printing...","group":"___is the flair of___"},{"source":"structure","target":"Case Study: O-14 Folded Exoskeleton","group":"___is the flair of___"},{"source":"assembly","target":"Computational LEGO® Technic Design","group":"___is the flair of___"},{"source":"structure","target":"...Non-coplanar Exoskeleton Supertall Tower","group":"___is the flair of___"},{"source":"multi-objective","target":"A fast and elitist...algorithm","group":"___is the flair of___"},{"source":"Palash Badjatya et al","target":"Carbon-negative cement...","group":"___is the author of___"},{"source":"embodied carbon","target":"Carbon-negative cement...","group":"___is the flair of___"},{"source":"concrete/cement","target":"Carbon-negative cement...","group":"___is the flair of___"},{"source":"bio-material","target":"Carbon-negative cement...","group":"___is the flair of___"},{"source":"wood","target":"...Humidity on 3D-printed...Wood-PLA...","group":"___is the flair of___"},{"source":"3D printing","target":"...Humidity on 3D-printed...Wood-PLA...","group":"___is the flair of___"},{"source":"structure","target":"Evolutionary Computation for Topology Optimization...","group":"___is the flair of___"},{"source":"topology","target":"Evolutionary Computation for Topology Optimization...","group":"___is the flair of___"},{"source":"algorithm","target":"Evolutionary Computation for Topology Optimization...","group":"___is the flair of___"},{"source":"3D printing","target":"Growing and Evolving 3D Prints","group":"___is the flair of___"},{"source":"topology","target":"Hybrid Evolutionary...Topology Optimization","group":"___is the flair of___"},{"source":"algorithm","target":"Hybrid Evolutionary...Topology Optimization","group":"___is the flair of___"},{"source":"structure","target":"...Geometry...Optimizing Component Structure","group":"___is the flair of___"},{"source":"algorithm","target":"...Geometry...Optimizing Component Structure","group":"___is the flair of___"},{"source":"assembly","target":"State of the Art...Assemblies with Rigid Parts","group":"___is the flair of___"},{"source":"3D printing","target":"...SIMP and BESO...Additive Manufacture","group":"___is the flair of___"},{"source":"topology","target":"...SIMP and BESO...Additive Manufacture","group":"___is the flair of___"},{"source":"algorithm","target":"...SIMP and BESO...Additive Manufacture","group":"___is the flair of___"},{"source":"Atlanta","target":"Ridwell","group":"___is the location of___"},{"source":"Austin","target":"Ridwell","group":"___is the location of___"},{"source":"Bay Area","target":"Ridwell","group":"___is the location of___"},{"source":"Denver","target":"Ridwell","group":"___is the location of___"},{"source":"Los Angeles","target":"Ridwell","group":"___is the location of___"},{"source":"Minneapolis-St. Paul","target":"Ridwell","group":"___is the location of___"},{"source":"Portland","target":"Ridwell","group":"___is the location of___"},{"source":"Seattle","target":"Ridwell","group":"___is the location of___"},{"source":"material reuse","target":"Ridwell","group":"___is the flair of___"},{"source":"material recycling","target":"Ridwell","group":"___is the flair of___"},{"source":"FEA","target":"FEA formulas","group":"___is the flair of___"},{"source":"machine learning","target":"...Multi-domain protein shape retrieval...","group":"___is the flair of___"},{"source":"geometry","target":"...Multi-domain protein shape retrieval...","group":"___is the flair of___"},{"source":"algorithm","target":"Simulated Annealing","group":"___is the flair of___"},{"source":"machine learning","target":"Generative Models: What do they know?...","group":"___is the flair of___"},{"source":"Lora","target":"Generative Models: What do they know?...","group":"___is the flair of___"},{"source":"machine learning","target":"...Complex Physics with Graph Networks","group":"___is the flair of___"},{"source":"GNN","target":"...Complex Physics with Graph Networks","group":"___is the flair of___"},{"source":"Google DeepMind","target":"Millions of new materials...deep learning","group":"___is the author of___"},{"source":"machine learning","target":"Millions of new materials...deep learning","group":"___is the flair of___"},{"source":"machine learning","target":"Distill","group":"___is the flair of___"},{"source":"machine learning","target":"Introduction to RL and Deep Q Networks","group":"___is the flair of___"},{"source":"OpeningAI","target":"Deep Deterministic Policy Gradient","group":"___is the author of___"},{"source":"machine learning","target":"Deep Deterministic Policy Gradient","group":"___is the flair of___"},{"source":"reinforcement learning","target":"Deep Deterministic Policy Gradient","group":"___is the flair of___"},{"source":"reinforcement learning","target":"Continuous Control with Deep Reinforcement Learning","group":"___is the flair of___"},{"source":"machine learning","target":"Continuous Control with Deep Reinforcement Learning","group":"___is the flair of___"},{"source":"machine learning","target":"Deep Reinforcement Learning and the Deadly Triad","group":"___is the flair of___"},{"source":"reinforcement learning","target":"Deep Reinforcement Learning and the Deadly Triad","group":"___is the flair of___"},{"source":"machine learning","target":"CONVERGENT AND EFFICIENT DEEP Q NETWORK ALGORITHM","group":"___is the flair of___"},{"source":"reinforcement learning","target":"CONVERGENT AND EFFICIENT DEEP Q NETWORK ALGORITHM","group":"___is the flair of___"},{"source":"machine learning","target":"...Divergence in Deep Q-Learning","group":"___is the flair of___"},{"source":"reinforcement learning","target":"...Divergence in Deep Q-Learning","group":"___is the flair of___"},{"source":"statistics","target":"list of probability distributions","group":"___is the flair of___"},{"source":"material performance","target":"Emergent...memory...metamaterials","group":"___is the flair of___"},{"source":"machine learning","target":"Attention Is All You Need","group":"___is the flair of___"}]}